In [1]:
import sqlite3

conn = sqlite3.connect("./database.sqlite")

In [2]:
import pandas as pd

df = pd.read_sql("SELECT * FROM students", conn)

In [3]:
df.head()

   id firstname     surname     subject  semester
0   1    Monika  Mustermann  Informatik         3
1   2       Max      Müller       Mathe         2
2   3     Erika      Müller         BWL         5
3   4     Laura  Mustermann       Mathe         2
4   5   Andreas     Schmidt  Informatik         4

In [7]:
df[df["surname"] == "Müller"]

   id firstname surname subject  semester
1   2       Max  Müller   Mathe         2
2   3     Erika  Müller     BWL         5

In [12]:
df[df["semester"] >= 4]

   id   firstname    surname     subject  semester
2   3       Erika     Müller         BWL         5
4   5     Andreas    Schmidt  Informatik         4
5   7  Maximilian  Schneider         BWL         4
6   8      Moritz    Fischer  Informatik         4

In [13]:
high_semester_students = df[df["semester"] >= 4]

In [14]:
high_semester_students.head()

   id   firstname    surname     subject  semester
2   3       Erika     Müller         BWL         5
4   5     Andreas    Schmidt  Informatik         4
5   7  Maximilian  Schneider         BWL         4
6   8      Moritz    Fischer  Informatik         4